code/openfoam/tutorials/incompressibleFluid/TJunction/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createZonesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fz1
{
    type        surface;
    surface     triSurface;
    file        "surface1.obj";
}

fz2
{
    type        surface;
    surface     triSurface;
    file        "surface2.obj";
}

// ************************************************************************* //
